#include <iostream>

#include "Classes/PlantHandler.h"
/*
2. В градински център се продават растения (наименование, цена, брой),
които биват дървета (височина, вид(иглолистни/широколистни)) и цветя (цвят).
Данните за всяко растение се съхранява в масив.
Да се състави програма, която изпълнява от меню следните операции:
-    добавя към масива данните на ново растение;
-    извежда всички въведени данни;
-    извежда данни за широколистните дървета;
-    създава масив с данните на растенията с поне 10 бройки.
 */
int main() {
    PlantHandler handler;
    handler.showMenu();
    return 0;
}
